Revit 2027 API
SpecTypeId.LinearMoment Property
 Linear Moment, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LinearMoment { get; }
Public Shared ReadOnly Property LinearMoment As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LinearMoment {
	ForgeTypeId^ get ();
}
static member LinearMoment : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace